#pragma once

/************************************************************************/

/**
* 스레드 종료 시간 체크용
* 스레드마다 종료되는 시간 체크하려면 주석 해제.
*/
//#define __THREADCHECK

#ifdef __THREADCHECK
#define __threadbreak __debugbreak();
#else
#define __threadbreak
#endif

/************************************************************************/

/**
* 각자 CPU 상태보다 높은 상태는 주석 처리
* 로딩에 코드 추가할 때 16/8/6 스레드별 함수 모두 세팅할 것.
*/
#define __1THREAD
#define __6THREADS
#define __8THREADS
//#define __16THREADS

/************************************************************************/

/**
* 맵 로딩 하려면 주석 처리.
*/
#define __MAPLOADING_OFF

/************************************************************************/

/**
* 메이 키보드로 컨트롤하려면 주석 해제.
*/
#define __CONTROL_MAY_KEYBOARD

/************************************************************************/

/**
* 각자 테스트용 디파인
*/
//#define __TEST_SE
//#define __TEST_JUNG
#define __TEST_HYE
//#define __TEST_TAEK
//#define __TEST_YOON
//#define __TEST_JIN
//#define __TEST_JUN

/************************************************************************/