#pragma once

/************************************************************************/

/**
* 스레드 종료 시간 체크용
* 스레드마다 종료되는 시간 체크하려면 주석 해제.
*/
//#define __THREADCHECK

#ifdef __THREADCHECK
#define __threadbreak __debugbreak();
#else
#define __threadbreak
#endif

/************************************************************************/

/**
* 사용할 스레드 개수 지정
*/
#define __THREAD_NUM 8

/************************************************************************/

/**
* 맵 로딩 하려면 주석 처리.
*/
#define __MAPLOADING_OFF

/************************************************************************/

/**
* 메이 키보드로 컨트롤하려면 주석 해제.
*/
#define __CONTROL_MAY_KEYBOARD

/************************************************************************/

/**
* 각자 테스트용 디파인
*/
//#define __TEST_SE
//#define __TEST_JUNG
//#define __TEST_HYE
#define __TEST_TAEK
//#define __TEST_YOON
//#define __TEST_JIN
//#define __TEST_JUN

/************************************************************************/

/**
* 디버깅창 생성 여부
*/
//#define __GAME_DEBUGGER